import os

# ==============================
# 🔐 إعداد التوكن (من GitHub Secrets)
# ==============================
# لا تحط التوكن هنا يدويًا!
# فقط احفظه في GitHub → Settings → Secrets → Actions
# وسَمِّ المتغير: DISCORD_BOT_TOKEN
BOT_TOKEN = os.getenv("DISCORD_BOT_TOKEN")

# ==============================
# 🔥 إعداد Firebase Realtime Database
# ==============================
# الرابط الأساسي لقاعدة بياناتك
FIREBASE_URL = "https://gang-war-2-default-rtdb.europe-west1.firebasedatabase.app"

# ==============================
# ⚙️ الإعدادات العامة
# ==============================
# ID المالك (أنت فقط من يقدر يستخدم أوامر الإدارة)
OWNER_ID = 949947235574095892

# ID الرتب والقنوات في ديسكورد
POLICE_ROLE_ID = 1342832610878951444     # رتبة الشرطة
GANG_PING_ROLE_ID = 1342832658908057681  # الرتبة اللي يتم منشنها وقت المهمة
DAILY_CHANNEL_ID = 1432630812137754715   # قناة الإعلانات اليومية
