# config.py
# ضع هنا توكن البوت ورابط قاعدة البيانات الريالتايم الخاصة بك
# يمكنك وضع القيم مباشرة أو استخدام متغيرات بيئة (env)

BOT_TOKEN = "YOUR_BOT_TOKEN_HERE"  # استبدل بالقيمة الحقيقية
FIREBASE_URL = "https://gang-war-2-default-rtdb.europe-west1.firebasedatabase.app/"  # رابط قاعدة بياناتك (مثال)
OWNER_ID = 949947235574095892  # ايدي مالك البوت (أنت)
# قنوات / رولات المهمة اليومية - عدّل الآيديات حسب سيرفرك
DAILY_CHANNEL_ID = 1432630812137754715  # القناة اللي يكتب فيها البوت اعلان المهمة
POLICE_ROLE_ID = 1342832610878951444   # الرتبة (العضو اللي يختار منه عشوائي)
MENTION_ROLE_ID = 1342832658908057681  # الرتبة الي تُمنشن في الإعلان (أو الي تعرض)
